//------------------------------------------------------------------------------------------------------------------------------------------------
//!	     GeometryDelta‚Ì\¬î•ñ‚ğ“o˜^‚·‚é
//------------------------------------------------------------------------------------------------------------------------------------------------
template <typename T>
void GeometryDeltaT<T>::set ( const GeometryLocationT<T> &_location, const Vec3T<T> &_direction, T _distance ){
	this->setValues ( _location.getIndex (), _location.getSubIndex (), _location.getWeight (), _location.getType () ); /* GeometryLocation‚ğ“o˜^ */
	this->direction = _direction;
	this->distance = _distance;
}

//------------------------------------------------------------------------------------------------------------------------------------------------
//!	     GeometryDelta‚Ì\¬î•ñ‚ğ“o˜^‚·‚é
//------------------------------------------------------------------------------------------------------------------------------------------------
template <typename T>
void GeometryDeltaT<T>::set ( const GeometryLocationT<T> &_location, const Vec3T<T> &_direction, T _distance, const std::vector<Vec3T<T>> &normalDelta ) {
	this->setValues ( _location.getIndex (), _location.getSubIndex (), _location.getWeight (), _location.getType () ); /* GeometryLocation‚ğ“o˜^ */
	this->direction = _direction;
	this->distance = _distance;
	this->normals = L16Array<Vec3T<T>> ( normalDelta );
}

//------------------------------------------------------------------------------------------------------------------------------------------------
//!	     Delta‚Ì’l‚ğÄİ’è‚·‚é
//------------------------------------------------------------------------------------------------------------------------------------------------
template <typename T>
void GeometryDeltaT<T>::reset ( const Vec3T<T> &_direction, T _distance ){
	if ( this->isValid () ){
		this->direction = _direction;
		this->distance = _distance;
	}
}

//------------------------------------------------------------------------------------------------------------------------------------------------
//!	     ƒƒP[ƒVƒ‡ƒ“î•ñ‚Ì‚İ‚ğ“o˜^‚·‚é
//------------------------------------------------------------------------------------------------------------------------------------------------
template <typename T>
void GeometryDeltaT<T>::setLocationValue ( const GeometryLocationT<T> &_location ) {
	this->setValues ( _location.getIndex(), _location.getSubIndex(), _location.getWeight(), _location.getType()); /* GeometryLocation‚ğ“o˜^ */
}

//------------------------------------------------------------------------------------------------------------------------------------------------
//!	     Xfo‚©‚ç‚Ì·•ª‚ğ“o˜^‚·‚é
//------------------------------------------------------------------------------------------------------------------------------------------------
template <typename T>
void GeometryDeltaT<T>::setDeltaValues ( const XfoT<T> &targetXfo, const Vec3T<T> &pointPosition ) {
	L16Array<Vec3T<T>> dummy(0);
	this->setDeltaValues ( targetXfo, pointPosition, dummy );
}

//------------------------------------------------------------------------------------------------------------------------------------------------
//!	     Xfo‚©‚ç‚Ì·•ª‚ğ“o˜^‚·‚é
//------------------------------------------------------------------------------------------------------------------------------------------------
template <typename T>
void GeometryDeltaT<T>::setDeltaValues ( const XfoT<T> &targetXfo, const Vec3T<T> &pointPosition, const L16Array<Vec3T<T>> &pointNormal ) {
	XfoT<T> invXfo = targetXfo.inverse ();
	if ( pointPosition.almostEqual ( targetXfo.tr ) ) {
		this->direction = Vec3T<T> ( 0, 1, 0 );
		this->distance = T ( 0.0 );
	} else {
		Vec3T<T> delta = invXfo * pointPosition;
		this->direction = delta.unit ();
		this->distance = delta.length ();
	}
	invXfo.tr = Vec3T<T> ( T ( 0.0 ) );
	invXfo.sc = Vec3T<T> ( T ( 1.0 ) );
	for ( u32 i = 0, n = pointNormal.size (); i<n; ++i ) {
		Vec3T<T> delta = invXfo * pointNormal [i];
		this->normals.push ( delta );
	}
}

//------------------------------------------------------------------------------------------------------------------------------------------------
//!	     ·•ª‚ğæ“¾‚·‚é
//------------------------------------------------------------------------------------------------------------------------------------------------
template <typename T>
Vec3T<T> GeometryDeltaT<T>::getDelta () const {
	return this->direction * this->distance;
}

//------------------------------------------------------------------------------------------------------------------------------------------------
//!	     ·•ª‚ÌŒü‚«î•ñ‚Ì‚İæ“¾‚·‚é
//------------------------------------------------------------------------------------------------------------------------------------------------
template <typename T>
Vec3T<T> GeometryDeltaT<T>::getDirection () const{
	return this->direction; 
}

//------------------------------------------------------------------------------------------------------------------------------------------------
//!	     ·•ª‚Ì‹——£î•ñ‚Ì‚İæ“¾‚·‚é
//------------------------------------------------------------------------------------------------------------------------------------------------
template <typename T>
T GeometryDeltaT<T>::getDistance () const{
	return this->distance;
}

//------------------------------------------------------------------------------------------------------------------------------------------------
//!	     ·•ª‚Ì–@üî•ñ‚ğæ“¾‚·‚é
//------------------------------------------------------------------------------------------------------------------------------------------------
template <typename T>
L16Array<Vec3T<T>> GeometryDeltaT<T>::getNormalDeltas () const {
	return this->normals;
}

//------------------------------------------------------------------------------------------------------------------------------------------------
//!	     ·•ª‚Ì–@üî•ñ‚ğˆê‚Âæ“¾‚·‚é
//------------------------------------------------------------------------------------------------------------------------------------------------
template <typename T>
Vec3T<T> GeometryDeltaT<T>::getNormalDelta ( u8 id ) const {
	assert ( id < this->normals.size () );
	return this->normals [id];
}

//------------------------------------------------------------------------------------------------------------------------------------------------
//!	     “o˜^‚µ‚Ä‚¢‚é–@üî•ñ‚Ì”‚ğ•Ô‚·
//------------------------------------------------------------------------------------------------------------------------------------------------
template <typename T>
u32 GeometryDeltaT<T>::normalCount () const{
	return ( this->normals.size () );
}

//------------------------------------------------------------------------------------------------------------------------------------------------
//!	     •K—v‚È·•ªî•ñŒQ‚ª‘µ‚Á‚Ä‚¢‚éê‡‚Ítrue‚ğ•Ô‚·
//------------------------------------------------------------------------------------------------------------------------------------------------
template <typename T>
Bool GeometryDeltaT<T>::isValid () const {
	Bool loc = this->GeometryLocationT<T>::isValid ();
	return loc && this->direction != Vec3T<T>() && T(0.0) < this->distance ;
}

//------------------------------------------------------------------------------------------------------------------------------------------------
//!	     –@ü‚Ì·•ªî•ñ‚ğ‚Á‚Ä‚¢‚éê‡‚Ítrue‚ğ•Ô‚·
//------------------------------------------------------------------------------------------------------------------------------------------------
template <typename T>
Bool GeometryDeltaT<T>::hasNormalValue () const{
	return this->normals.size () != 0;
}